docker.org
#+INCLUDE: ./main.setup
#+TITLE: docker
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

* 개요
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: ko
  :END:      

* 설치 방법
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG: ko
  :END:      

** 필요 사항
   :PROPERTIES: 
   :CUSTOM_ID: prerequisites
   :LANG: ko
   :END:      

** 설치
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG: ko
  :END:      

** Ubuntu 16.04 ~

*** Update repository
#+NAME: ubuntu_update-install_docker
#+BEGIN_SRC sh
# Remove old version
$ sudo apt-get remove docker docker-engine docker.io

# Install packages
$ sudo apt-get install \
    apt-transport-https \
    ca-certificates \
    curl \
    software-properties-common

# Add Docker's official GPG key
$ curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -

$ sudo apt-key fingerprint 0EBFCD88
#+END_SRC

*** Based on architectures
**** x86_64 / amd64
#+NAME: ubuntu_amd64-install_docker
#+BEGIN_SRC sh
$ sudo add-apt-repository \
   "deb [arch=amd64] https://download.docker.com/linux/ubuntu \
   $(lsb_release -cs) \
   stable"
#+END_SRC

**** armhf
#+NAME: ubuntu_amd64-install_docker
#+BEGIN_SRC sh
$ sudo add-apt-repository \
   "deb [arch=amd64] https://download.docker.com/linux/ubuntu \
   $(lsb_release -cs) \
   stable"
#+END_SRC

**** IBM Power
#+NAME: ubuntu_amd64-install_docker
#+BEGIN_SRC sh
$ sudo add-apt-repository \
   "deb [arch=ppc64el] https://download.docker.com/linux/ubuntu \
   $(lsb_release -cs) \
   stable"
#+END_SRC

**** IBM Z (s390x)
#+NAME: ubuntu_amd64-install_docker
#+BEGIN_SRC sh
$ sudo add-apt-repository \
   "deb [arch=s390x] https://download.docker.com/linux/ubuntu \
   $(lsb_release -cs) \
   stable"
#+END_SRC
*** Install Docker-CE
#+NAME: ubuntu-install_docker
#+BEGIN_SRC sh
$ sudo apt-get install docker-ce
#+END_SRC

** Mac
- [[https://download.docker.com/mac/stable/Docker.dmg][Docker.dmg(Official)]]

** 설치된 패키지
   :PROPERTIES: 
   :CUSTOM_ID: packages
   :LANG: ko
   :END:      

** 확인
   :PROPERTIES: 
   :CUSTOM_ID: check
   :LANG: ko
   :END:      

#+BEGIN_SRC sh
$ sudo docker run hello-world
#+END_SRC

* 사용법
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: ko
  :END:      

** 구조
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: ko
   :END:      

** 설정
   :PROPERTIES: 
   :CUSTOM_ID: configuration
   :LANG: ko
   :END:      

** 옵션
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: ko
   :END:      

** 사용 예
   :PROPERTIES: 
   :CUSTOM_ID: examples
   :LANG: ko
   :END:      

* 관련 항목
  :PROPERTIES: 
  :LANG: ko
  :END:      

* 참고자료
  :PROPERTIES: 
  :LANG: ko
  :END:      

- [[https://docs.docker.com/docker-for-mac/install/][Install Docker for Mac(Official)]]
- [[https://docs.docker.com/install/][Install Docker(Offical)]]
