zh/docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2018-02-20 Tue 17:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>docker</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>
<meta name="title" content="docker - Linux命令">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="docker - Linux命令">
<meta property="og:description" content="">
<meta name="twitter:title" content="docker - Linux命令">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">docker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org749734b">如何安装</a>
<ul>
<li><a href="#org8ff9089">先决条件</a></li>
<li><a href="#orga1898ab">安装</a></li>
<li><a href="#orgd0ac1ed">Ubuntu 16.04 ~</a>
<ul>
<li><a href="#org3816a32">Update repository</a></li>
<li><a href="#org5499c1d">Based on architectures</a>
<ul>
<li><a href="#org0265a7b">x86_64 / amd64</a></li>
<li><a href="#org8f09dd3">armhf</a></li>
<li><a href="#org0944dd5">IBM Power</a></li>
<li><a href="#org8341d19">IBM Z (s390x)</a></li>
</ul>
</li>
<li><a href="#orgd4a829e">Install Docker-CE</a></li>
</ul>
</li>
<li><a href="#orgd78e621">Mac</a></li>
<li><a href="#org50cc2f0">安装的软件包</a></li>
<li><a href="#orgdbc350e">检查</a></li>
</ul>
</li>
<li><a href="#orgf36bf2f">参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org749734b" class="outline-2">
<h2 id="org749734b">如何安装</h2>
<div class="outline-text-2" id="text-org749734b">
</div><div id="outline-container-org8ff9089" class="outline-3">
<h3 id="org8ff9089">先决条件</h3>
</div>

<div id="outline-container-orga1898ab" class="outline-3">
<h3 id="orga1898ab">安装</h3>
</div>

<div id="outline-container-orgd0ac1ed" class="outline-3">
<h3 id="orgd0ac1ed">Ubuntu 16.04 ~</h3>
<div class="outline-text-3" id="text-orgd0ac1ed">
</div><div id="outline-container-org3816a32" class="outline-4">
<h4 id="org3816a32">Update repository</h4>
<div class="outline-text-4" id="text-org3816a32">
<div class="org-src-container">
<pre class="src src-sh" id="org6e909fc"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove old version</span>
$ sudo apt-get remove docker docker-engine docker.io

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Install packages</span>
$ sudo apt-get install <span style="font-style: italic;">\</span>
    apt-transport-https <span style="font-style: italic;">\</span>
    ca-certificates <span style="font-style: italic;">\</span>
    curl <span style="font-style: italic;">\</span>
    software-properties-common

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add Docker's official GPG key</span>
$ curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -

$ sudo apt-key fingerprint 0EBFCD88
</pre>
</div>
</div>
</div>

<div id="outline-container-org5499c1d" class="outline-4">
<h4 id="org5499c1d">Based on architectures</h4>
<div class="outline-text-4" id="text-org5499c1d">
</div><div id="outline-container-org0265a7b" class="outline-5">
<h5 id="org0265a7b">x86_64 / amd64</h5>
<div class="outline-text-5" id="text-org0265a7b">
<div class="org-src-container">
<pre class="src src-sh" id="org85aca31">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=amd64] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f09dd3" class="outline-5">
<h5 id="org8f09dd3">armhf</h5>
<div class="outline-text-5" id="text-org8f09dd3">
<div class="org-src-container">
<pre class="src src-sh" id="orge9cd2f2">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=amd64] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0944dd5" class="outline-5">
<h5 id="org0944dd5">IBM Power</h5>
<div class="outline-text-5" id="text-org0944dd5">
<div class="org-src-container">
<pre class="src src-sh" id="org3d7dde3">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=ppc64el] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8341d19" class="outline-5">
<h5 id="org8341d19">IBM Z (s390x)</h5>
<div class="outline-text-5" id="text-org8341d19">
<div class="org-src-container">
<pre class="src src-sh" id="orga8aab12">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=s390x] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd4a829e" class="outline-4">
<h4 id="orgd4a829e">Install Docker-CE</h4>
<div class="outline-text-4" id="text-orgd4a829e">
<div class="org-src-container">
<pre class="src src-sh" id="org67a9cdb">$ sudo apt-get install docker-ce
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd78e621" class="outline-3">
<h3 id="orgd78e621">Mac</h3>
<div class="outline-text-3" id="text-orgd78e621">
<ul class="org-ul">
<li><a href="https://download.docker.com/mac/stable/Docker.dmg">Docker.dmg(Official)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org50cc2f0" class="outline-3">
<h3 id="org50cc2f0">安装的软件包</h3>
</div>

<div id="outline-container-orgdbc350e" class="outline-3">
<h3 id="orgdbc350e">检查</h3>
<div class="outline-text-3" id="text-orgdbc350e">
<div class="org-src-container">
<pre class="src src-sh">$ sudo docker run hello-world
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf36bf2f" class="outline-2">
<h2 id="orgf36bf2f">参考</h2>
<div class="outline-text-2" id="text-orgf36bf2f">
<ul class="org-ul">
<li><a href="https://docs.docker.com/docker-for-mac/install/">Install Docker for Mac(Official)</a></li>
<li><a href="https://docs.docker.com/install/">Install Docker(Offical)</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-20 Tue 17:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
